Ryan-Rogers/MMSoftware/MM_2015.X/support/pic24f/h/p24F08KL402.h
/* IPC6 */
#define _CCP3IP IPC6bits.CCP3IP
#define _T4IP IPC6bits.T4IP
#define _CCP3IP0 IPC6bits.CCP3IP0
#define _CCP3IP1 IPC6bits.CCP3IP1
#define _CCP3IP2 IPC6bits.CCP3IP2
#define _T4IP0 IPC6bits.T4IP0
#define _T4IP1 IPC6bits.T4IP1
#define _T4IP2 IPC6bits.T4IP2

/* IPC7 */
#define _INT2IP IPC7bits.INT2IP
#define _U2RXIP IPC7bits.U2RXIP
#define _U2TXIP IPC7bits.U2TXIP
#define _INT2IP0 IPC7bits.INT2IP0
#define _INT2IP1 IPC7bits.INT2IP1
#define _INT2IP2 IPC7bits.INT2IP2
#define _U2RXIP0 IPC7bits.U2RXIP0
#define _U2RXIP1 IPC7bits.U2RXIP1
#define _U2RXIP2 IPC7bits.U2RXIP2
#define _U2TXIP0 IPC7bits.U2TXIP0
#define _U2TXIP1 IPC7bits.U2TXIP1
#define _U2TXIP2 IPC7bits.U2TXIP2

/* IPC9 */
#define _T3GIP IPC9bits.T3GIP
#define _T3GIP0 IPC9bits.T3GIP0
#define _T3GIP1 IPC9bits.T3GIP1
#define _T3GIP2 IPC9bits.T3GIP2

/* IPC12 */
#define _SSP2IP IPC12bits.SSP2IP
#define _BCL2IP IPC12bits.BCL2IP
#define _SSP2IP0 IPC12bits.SSP2IP0
#define _SSP2IP1 IPC12bits.SSP2IP1
#define _SSP2IP2 IPC12bits.SSP2IP2
#define _BCL2IP0 IPC12bits.BCL2IP0
#define _BCL2IP1 IPC12bits.BCL2IP1
#define _BCL2IP2 IPC12bits.BCL2IP2

/* IPC16 */
#define _U1ERIP IPC16bits.U1ERIP
#define _U2ERIP IPC16bits.U2ERIP
#define _U1ERIP0 IPC16bits.U1ERIP0
#define _U1ERIP1 IPC16bits.U1ERIP1
#define _U1ERIP2 IPC16bits.U1ERIP2
#define _U2ERIP0 IPC16bits.U2ERIP0
#define _U2ERIP1 IPC16bits.U2ERIP1
#define _U2ERIP2 IPC16bits.U2ERIP2

/* IPC18 */
#define _HLVDIP IPC18bits.HLVDIP
#define _HLVDIP0 IPC18bits.HLVDIP0
#define _HLVDIP1 IPC18bits.HLVDIP1
#define _HLVDIP2 IPC18bits.HLVDIP2

/* IPC20 */
#define _ULPWUIP IPC20bits.ULPWUIP
#define _ULPWUIP0 IPC20bits.ULPWUIP0
#define _ULPWUIP1 IPC20bits.ULPWUIP1
#define _ULPWUIP2 IPC20bits.ULPWUIP2

/* INTTREG */
#define _VECNUM INTTREGbits.VECNUM
#define _ILR INTTREGbits.ILR
#define _VHOLD INTTREGbits.VHOLD
#define _CPUIRQ INTTREGbits.CPUIRQ
#define _VECNUM0 INTTREGbits.VECNUM0
#define _VECNUM1 INTTREGbits.VECNUM1
#define _VECNUM2 INTTREGbits.VECNUM2
#define _VECNUM3 INTTREGbits.VECNUM3
#define _VECNUM4 INTTREGbits.VECNUM4
#define _VECNUM5 INTTREGbits.VECNUM5
#define _VECNUM6 INTTREGbits.VECNUM6
#define _ILR0 INTTREGbits.ILR0
#define _ILR1 INTTREGbits.ILR1
#define _ILR2 INTTREGbits.ILR2
#define _ILR3 INTTREGbits.ILR3

/* T1CON */
#define _TCS T1CONbits.TCS
#define _TSYNC T1CONbits.TSYNC
#define _TCKPS T1CONbits.TCKPS
/* Bitname _TGATE cannot be defined because it is used by more than one SFR */
#define _TECS T1CONbits.TECS
#define _TSIDL T1CONbits.TSIDL
#define _TON T1CONbits.TON
#define _TCKPS0 T1CONbits.TCKPS0
#define _TCKPS1 T1CONbits.TCKPS1
#define _TECS0 T1CONbits.TECS0
#define _TECS1 T1CONbits.TECS1
#define _T1ECS T1CONbits.T1ECS
#define _T1ECS0 T1CONbits.T1ECS0
#define _T1ECS1 T1CONbits.T1ECS1

/* T2CON */
#define _T2CKPS T2CONbits.T2CKPS
#define _TMR2ON T2CONbits.TMR2ON
#define _T2OUTPS T2CONbits.T2OUTPS
/* Bitname _TCKPS cannot be defined because it is used by more than one SFR */
/* Bitname _TON cannot be defined because it is used by more than one SFR */
/* Bitname _TOUTPS cannot be defined because it is used by more than one SFR */
#define _T2CKPS0 T2CONbits.T2CKPS0
#define _T2CKPS1 T2CONbits.T2CKPS1
#define _T2OUTPS0 T2CONbits.T2OUTPS0
#define _T2OUTPS1 T2CONbits.T2OUTPS1
#define _T2OUTPS2 T2CONbits.T2OUTPS2
#define _T2OUTPS3 T2CONbits.T2OUTPS3

/* T3GCON */
#define _T3GSS T3GCONbits.T3GSS
#define _T3GVAL T3GCONbits.T3GVAL
#define _T3GGO T3GCONbits.T3GGO
#define _T3GSPM T3GCONbits.T3GSPM
#define _T3GTM T3GCONbits.T3GTM
#define _T3GPOL T3GCONbits.T3GPOL
#define _TMR3GE T3GCONbits.TMR3GE
#define _T3GSS0 T3GCONbits.T3GSS0
#define _T3GSS1 T3GCONbits.T3GSS1
#define _NOT_T3DONE T3GCONbits.NOT_T3DONE
#define _TGSS T3GCONbits.TGSS
#define _TGVAL T3GCONbits.TGVAL
#define _TGGO T3GCONbits.TGGO
#define _TGSE T3GCONbits.TGSE
#define _TGTM T3GCONbits.TGTM
#define _TGPOL T3GCONbits.TGPOL
/* Bitname _TGATE cannot be defined because it is used by more than one SFR */

/* T3CON */
#define _TMR3ON T3CONbits.TMR3ON
#define _NOT_T3SYNC T3CONbits.NOT_T3SYNC
#define _T3OSCEN T3CONbits.T3OSCEN
#define _T3CKPS T3CONbits.T3CKPS
#define _TMR3CS T3CONbits.TMR3CS
/* Bitname _TON cannot be defined because it is used by more than one SFR */
#define _NOT_TSYNC T3CONbits.NOT_TSYNC
/* Bitname _SOSCEN cannot be defined because it is used by more than one SFR */
/* Bitname _TCKPS cannot be defined because it is used by more than one SFR */
/* Bitname _TCS cannot be defined because it is used by more than one SFR */
#define _T3CKPS0 T3CONbits.T3CKPS0
#define _T3CKPS1 T3CONbits.T3CKPS1
#define _TMR3CS0 T3CONbits.TMR3CS0
#define _TMR3CS1 T3CONbits.TMR3CS1

/* T4CON */
#define _T4CKPS T4CONbits.T4CKPS
#define _TMR4ON T4CONbits.TMR4ON
#define _T4OUTPS T4CONbits.T4OUTPS
/* Bitname _TCKPS cannot be defined because it is used by more than one SFR */
/* Bitname _TON cannot be defined because it is used by more than one SFR */
/* Bitname _TOUTPS cannot be defined because it is used by more than one SFR */
#define _T4CKPS0 T4CONbits.T4CKPS0
#define _T4CKPS1 T4CONbits.T4CKPS1
#define _T4OUTPS0 T4CONbits.T4OUTPS0
#define _T4OUTPS1 T4CONbits.T4OUTPS1
#define _T4OUTPS2 T4CONbits.T4OUTPS2
#define _T4OUTPS3 T4CONbits.T4OUTPS3

/* CCPTMRS0 */
#define _C1TSEL0 CCPTMRS0bits.C1TSEL0
#define _C2TSEL0 CCPTMRS0bits.C2TSEL0
#define _C3TSEL0 CCPTMRS0bits.C3TSEL0

/* CCP1CON */
/* Bitname _CCPM cannot be defined because it is used by more than one SFR */
/* Bitname _DCB cannot be defined because it is used by more than one SFR */
#define _PM CCP1CONbits.PM
/* Bitname _CCPM0 cannot be defined because it is used by more than one SFR */
/* Bitname _CCPM1 cannot be defined because it is used by more than one SFR */
/* Bitname _CCPM2 cannot be defined because it is used by more than one SFR */
/* Bitname _CCPM3 cannot be defined because it is used by more than one SFR */
/* Bitname _DCB0 cannot be defined because it is used by more than one SFR */
/* Bitname _DCB1 cannot be defined because it is used by more than one SFR */
#define _PM0 CCP1CONbits.PM0
#define _PM1 CCP1CONbits.PM1
#define _CCP1M CCP1CONbits.CCP1M
#define _DC1B CCP1CONbits.DC1B
#define _P1M CCP1CONbits.P1M
#define _CCP1M0 CCP1CONbits.CCP1M0
#define _CCP1M1 CCP1CONbits.CCP1M1
#define _CCP1M2 CCP1CONbits.CCP1M2
#define _CCP1M3 CCP1CONbits.CCP1M3
#define _DC1B0 CCP1CONbits.DC1B0
#define _DC1B1 CCP1CONbits.DC1B1
#define _P1M0 CCP1CONbits.P1M0
#define _P1M1 CCP1CONbits.P1M1

/* ECCP1DEL */
#define _PDC ECCP1DELbits.PDC
#define _PRSEN ECCP1DELbits.PRSEN
#define _PDC0 ECCP1DELbits.PDC0
#define _PDC1 ECCP1DELbits.PDC1
#define _PDC2 ECCP1DELbits.PDC2
#define _PDC3 ECCP1DELbits.PDC3
#define _PDC4 ECCP1DELbits.PDC4
#define _PDC5 ECCP1DELbits.PDC5
#define _PDC6 ECCP1DELbits.PDC6
#define _P1DC ECCP1DELbits.P1DC
#define _P1RSEN ECCP1DELbits.P1RSEN
#define _P1DC0 ECCP1DELbits.P1DC0
#define _P1DC1 ECCP1DELbits.P1DC1
#define _P1DC2 ECCP1DELbits.P1DC2
#define _P1DC3 ECCP1DELbits.P1DC3
#define _P1DC4 ECCP1DELbits.P1DC4
#define _P1DC5 ECCP1DELbits.P1DC5
#define _P1DC6 ECCP1DELbits.P1DC6

/* ECCP1AS */
#define _PSSBD ECCP1ASbits.PSSBD
#define _PSSAC ECCP1ASbits.PSSAC
#define _ECCPAS ECCP1ASbits.ECCPAS
#define _ECCPASE ECCP1ASbits.ECCPASE
#define _PSSBD0 ECCP1ASbits.PSSBD0
#define _PSSBD1 ECCP1ASbits.PSSBD1
#define _PSSAC0 ECCP1ASbits.PSSAC0
#define _PSSAC1 ECCP1ASbits.PSSAC1
#define _ECCPAS0 ECCP1ASbits.ECCPAS0
#define _ECCPAS1 ECCP1ASbits.ECCPAS1
#define _ECCPAS2 ECCP1ASbits.ECCPAS2
#define _PSS1BD ECCP1ASbits.PSS1BD
#define _PSS1AC ECCP1ASbits.PSS1AC
#define _ECCP1AS ECCP1ASbits.ECCP1AS
#define _PSS1BD0 ECCP1ASbits.PSS1BD0
#define _PSS1BD1 ECCP1ASbits.PSS1BD1
#define _PSS1AC0 ECCP1ASbits.PSS1AC0
#define _PSS1AC1 ECCP1ASbits.PSS1AC1
#define _ECCP1AS0 ECCP1ASbits.ECCP1AS0
#define _ECCP1AS1 ECCP1ASbits.ECCP1AS1
#define _ECCP1AS2 ECCP1ASbits.ECCP1AS2

/* PSTR1CON */
#define _STRA PSTR1CONbits.STRA
#define _STRB PSTR1CONbits.STRB
#define _STRC PSTR1CONbits.STRC
#define _STRD PSTR1CONbits.STRD
#define _STRSYNC PSTR1CONbits.STRSYNC
#define _CMPL PSTR1CONbits.CMPL
#define _CMPL0 PSTR1CONbits.CMPL0
#define _CMPL1 PSTR1CONbits.CMPL1

/* CCP2CON */
/* Bitname _CCPM cannot be defined because it is used by more than one SFR */
/* Bitname _DCB cannot be defined because it is used by more than one SFR */
/* Bitname _CCPM0 cannot be defined because it is used by more than one SFR */
/* Bitname _CCPM1 cannot be defined because it is used by more than one SFR */
/* Bitname _CCPM2 cannot be defined because it is used by more than one SFR */
/* Bitname _CCPM3 cannot be defined because it is used by more than one SFR */
/* Bitname _DCB0 cannot be defined because it is used by more than one SFR */
/* Bitname _DCB1 cannot be defined because it is used by more than one SFR */
#define _CCP2M CCP2CONbits.CCP2M
#define _DC2B CCP2CONbits.DC2B
#define _CCP2M0 CCP2CONbits.CCP2M0
#define _CCP2M1 CCP2CONbits.CCP2M1
#define _CCP2M2 CCP2CONbits.CCP2M2
#define _CCP2M3 CCP2CONbits.CCP2M3
#define _DC2B0 CCP2CONbits.DC2B0
#define _DC2B1 CCP2CONbits.DC2B1

/* CCP3CON */
/* Bitname _CCPM cannot be defined because it is used by more than one SFR */
/* Bitname _DCB cannot be defined because it is used by more than one SFR */
/* Bitname _CCPM0 cannot be defined because it is used by more than one SFR */
/* Bitname _CCPM1 cannot be defined because it is used by more than one SFR */
/* Bitname _CCPM2 cannot be defined because it is used by more than one SFR */
/* Bitname _CCPM3 cannot be defined because it is used by more than one SFR */
/* Bitname _DCB0 cannot be defined because it is used by more than one SFR */
/* Bitname _DCB1 cannot be defined because it is used by more than one SFR */
#define _CCP3M CCP3CONbits.CCP3M
#define _DC3B CCP3CONbits.DC3B
#define _CCP3M0 CCP3CONbits.CCP3M0
#define _CCP3M1 CCP3CONbits.CCP3M1
#define _CCP3M2 CCP3CONbits.CCP3M2
#define _CCP3M3 CCP3CONbits.CCP3M3
#define _DC3B0 CCP3CONbits.DC3B0
#define _DC3B1 CCP3CONbits.DC3B1

/* SPI1BUF */
/* Bitname _SSPBUF cannot be defined because it is used by more than one SFR */
#define _SPI1BUF SPI1BUFbits.SPI1BUF

/* SSP1CON1 */
/* Bitname _SSPM cannot be defined because it is used by more than one SFR */
/* Bitname _CKP cannot be defined because it is used by more than one SFR */
/* Bitname _SSPEN cannot be defined because it is used by more than one SFR */
/* Bitname _SSPOV cannot be defined because it is used by more than one SFR */
/* Bitname _WCOL cannot be defined because it is used by more than one SFR */
/* Bitname _SSPM0 cannot be defined because it is used by more than one SFR */
/* Bitname _SSPM1 cannot be defined because it is used by more than one SFR */
/* Bitname _SSPM2 cannot be defined because it is used by more than one SFR */
/* Bitname _SSPM3 cannot be defined because it is used by more than one SFR */

/* SSP1CON2 */
/* Bitname _SEN cannot be defined because it is used by more than one SFR */
/* Bitname _RSEN cannot be defined because it is used by more than one SFR */
/* Bitname _PEN cannot be defined because it is used by more than one SFR */
/* Bitname _RCEN cannot be defined because it is used by more than one SFR */
/* Bitname _ACKEN cannot be defined because it is used by more than one SFR */
/* Bitname _ACKDT cannot be defined because it is used by more than one SFR */
/* Bitname _ACKSTAT cannot be defined because it is used by more than one SFR */
/* Bitname _GCEN cannot be defined because it is used by more than one SFR */
/* Bitname _ADMSK cannot be defined because it is used by more than one SFR */
/* Bitname _ADMSK1 cannot be defined because it is used by more than one SFR */
/* Bitname _ADMSK2 cannot be defined because it is used by more than one SFR */
/* Bitname _ADMSK3 cannot be defined because it is used by more than one SFR */
/* Bitname _ADMSK4 cannot be defined because it is used by more than one SFR */
/* Bitname _ADMSK5 cannot be defined because it is used by more than one SFR */

/* SSP1CON3 */
/* Bitname _DHEN cannot be defined because it is used by more than one SFR */
/* Bitname _AHEN cannot be defined because it is used by more than one SFR */
/* Bitname _SBCDE cannot be defined because it is used by more than one SFR */
/* Bitname _SDAHT cannot be defined because it is used by more than one SFR */
/* Bitname _BOEN cannot be defined because it is used by more than one SFR */
/* Bitname _SCIE cannot be defined because it is used by more than one SFR */
/* Bitname _PCIE cannot be defined because it is used by more than one SFR */
/* Bitname _ACKTIM cannot be defined because it is used by more than one SFR */

/* SSP1STAT */
/* Bitname _BF cannot be defined because it is used by more than one SFR */
/* Bitname _UA cannot be defined because it is used by more than one SFR */
/* Bitname _R_NOT_W cannot be defined because it is used by more than one SFR */
/* Bitname _S cannot be defined because it is used by more than one SFR */
/* Bitname _P cannot be defined because it is used by more than one SFR */
/* Bitname _D_NOT_A cannot be defined because it is used by more than one SFR */
/* Bitname _CKE cannot be defined because it is used by more than one SFR */
/* Bitname _SMP cannot be defined because it is used by more than one SFR */
/* Bitname _R_W cannot be defined because it is used by more than one SFR */
/* Bitname _D_A cannot be defined because it is used by more than one SFR */
/* Bitname _NOT_W cannot be defined because it is used by more than one SFR */
/* Bitname _NOT_A cannot be defined because it is used by more than one SFR */
/* Bitname _NOT_WRITE cannot be defined because it is used by more than one SFR */
/* Bitname _NOT_ADDRESS cannot be defined because it is used by more than one SFR */
/* Bitname _READ_WRITE cannot be defined because it is used by more than one SFR */
/* Bitname _DATA_ADDRESS cannot be defined because it is used by more than one SFR */
/* Bitname _I2C_READ cannot be defined because it is used by more than one SFR */
/* Bitname _I2C_START cannot be defined because it is used by more than one SFR */
/* Bitname _I2C_STOP cannot be defined because it is used by more than one SFR */
/* Bitname _I2C_DAT cannot be defined because it is used by more than one SFR */

/* I2C1ADD */
/* Bitname _SSPADD cannot be defined because it is used by more than one SFR */
/* Bitname _I2CADD cannot be defined because it is used by more than one SFR */

/* I2C1MSK */
/* Bitname _MSK0 cannot be defined because it is used by more than one SFR */
/* Bitname _MSK1 cannot be defined because it is used by more than one SFR */
/* Bitname _MSK2 cannot be defined because it is used by more than one SFR */
/* Bitname _MSK3 cannot be defined because it is used by more than one SFR */
/* Bitname _MSK4 cannot be defined because it is used by more than one SFR */
/* Bitname _MSK5 cannot be defined because it is used by more than one SFR */
/* Bitname _MSK6 cannot be defined because it is used by more than one SFR */
/* Bitname _MSK7 cannot be defined because it is used by more than one SFR */
/* Bitname _AMSK cannot be defined because it is used by more than one SFR */

