Ryan-Rogers/MMSoftware/MM_2015.X/support/pic24f/h/p24F08KL402.h
#define _CCP2CON_CCP2M0_POSITION                 0x00000000
#define _CCP2CON_CCP2M0_MASK                     0x00000001
#define _CCP2CON_CCP2M0_LENGTH                   0x00000001

#define _CCP2CON_CCP2M1_POSITION                 0x00000001
#define _CCP2CON_CCP2M1_MASK                     0x00000002
#define _CCP2CON_CCP2M1_LENGTH                   0x00000001

#define _CCP2CON_CCP2M2_POSITION                 0x00000002
#define _CCP2CON_CCP2M2_MASK                     0x00000004
#define _CCP2CON_CCP2M2_LENGTH                   0x00000001

#define _CCP2CON_CCP2M3_POSITION                 0x00000003
#define _CCP2CON_CCP2M3_MASK                     0x00000008
#define _CCP2CON_CCP2M3_LENGTH                   0x00000001

#define _CCP2CON_DC2B0_POSITION                  0x00000004
#define _CCP2CON_DC2B0_MASK                      0x00000010
#define _CCP2CON_DC2B0_LENGTH                    0x00000001

#define _CCP2CON_DC2B1_POSITION                  0x00000005
#define _CCP2CON_DC2B1_MASK                      0x00000020
#define _CCP2CON_DC2B1_LENGTH                    0x00000001

#define _CCP3CON_CCPM_POSITION                   0x00000000
#define _CCP3CON_CCPM_MASK                       0x0000000F
#define _CCP3CON_CCPM_LENGTH                     0x00000004

#define _CCP3CON_DCB_POSITION                    0x00000004
#define _CCP3CON_DCB_MASK                        0x00000030
#define _CCP3CON_DCB_LENGTH                      0x00000002

#define _CCP3CON_CCPM0_POSITION                  0x00000000
#define _CCP3CON_CCPM0_MASK                      0x00000001
#define _CCP3CON_CCPM0_LENGTH                    0x00000001

#define _CCP3CON_CCPM1_POSITION                  0x00000001
#define _CCP3CON_CCPM1_MASK                      0x00000002
#define _CCP3CON_CCPM1_LENGTH                    0x00000001

#define _CCP3CON_CCPM2_POSITION                  0x00000002
#define _CCP3CON_CCPM2_MASK                      0x00000004
#define _CCP3CON_CCPM2_LENGTH                    0x00000001

#define _CCP3CON_CCPM3_POSITION                  0x00000003
#define _CCP3CON_CCPM3_MASK                      0x00000008
#define _CCP3CON_CCPM3_LENGTH                    0x00000001

#define _CCP3CON_DCB0_POSITION                   0x00000004
#define _CCP3CON_DCB0_MASK                       0x00000010
#define _CCP3CON_DCB0_LENGTH                     0x00000001

#define _CCP3CON_DCB1_POSITION                   0x00000005
#define _CCP3CON_DCB1_MASK                       0x00000020
#define _CCP3CON_DCB1_LENGTH                     0x00000001

#define _CCP3CON_CCP3M_POSITION                  0x00000000
#define _CCP3CON_CCP3M_MASK                      0x0000000F
#define _CCP3CON_CCP3M_LENGTH                    0x00000004

#define _CCP3CON_DC3B_POSITION                   0x00000004
#define _CCP3CON_DC3B_MASK                       0x00000030
#define _CCP3CON_DC3B_LENGTH                     0x00000002

#define _CCP3CON_CCP3M0_POSITION                 0x00000000
#define _CCP3CON_CCP3M0_MASK                     0x00000001
#define _CCP3CON_CCP3M0_LENGTH                   0x00000001

#define _CCP3CON_CCP3M1_POSITION                 0x00000001
#define _CCP3CON_CCP3M1_MASK                     0x00000002
#define _CCP3CON_CCP3M1_LENGTH                   0x00000001

#define _CCP3CON_CCP3M2_POSITION                 0x00000002
#define _CCP3CON_CCP3M2_MASK                     0x00000004
#define _CCP3CON_CCP3M2_LENGTH                   0x00000001

#define _CCP3CON_CCP3M3_POSITION                 0x00000003
#define _CCP3CON_CCP3M3_MASK                     0x00000008
#define _CCP3CON_CCP3M3_LENGTH                   0x00000001

#define _CCP3CON_DC3B0_POSITION                  0x00000004
#define _CCP3CON_DC3B0_MASK                      0x00000010
#define _CCP3CON_DC3B0_LENGTH                    0x00000001

#define _CCP3CON_DC3B1_POSITION                  0x00000005
#define _CCP3CON_DC3B1_MASK                      0x00000020
#define _CCP3CON_DC3B1_LENGTH                    0x00000001

#define _SPI1BUF_SSPBUF_POSITION                 0x00000000
#define _SPI1BUF_SSPBUF_MASK                     0x000000FF
#define _SPI1BUF_SSPBUF_LENGTH                   0x00000008

#define _SPI1BUF_SPI1BUF_POSITION                0x00000000
#define _SPI1BUF_SPI1BUF_MASK                    0x000000FF
#define _SPI1BUF_SPI1BUF_LENGTH                  0x00000008

#define _SSP1BUF_SSPBUF_POSITION                 0x00000000
#define _SSP1BUF_SSPBUF_MASK                     0x000000FF
#define _SSP1BUF_SSPBUF_LENGTH                   0x00000008

#define _SSP1BUF_SPI1BUF_POSITION                0x00000000
#define _SSP1BUF_SPI1BUF_MASK                    0x000000FF
#define _SSP1BUF_SPI1BUF_LENGTH                  0x00000008

#define _SSP1CON1_SSPM_POSITION                  0x00000000
#define _SSP1CON1_SSPM_MASK                      0x0000000F
#define _SSP1CON1_SSPM_LENGTH                    0x00000004

#define _SSP1CON1_CKP_POSITION                   0x00000004
#define _SSP1CON1_CKP_MASK                       0x00000010
#define _SSP1CON1_CKP_LENGTH                     0x00000001

#define _SSP1CON1_SSPEN_POSITION                 0x00000005
#define _SSP1CON1_SSPEN_MASK                     0x00000020
#define _SSP1CON1_SSPEN_LENGTH                   0x00000001

#define _SSP1CON1_SSPOV_POSITION                 0x00000006
#define _SSP1CON1_SSPOV_MASK                     0x00000040
#define _SSP1CON1_SSPOV_LENGTH                   0x00000001

#define _SSP1CON1_WCOL_POSITION                  0x00000007
#define _SSP1CON1_WCOL_MASK                      0x00000080
#define _SSP1CON1_WCOL_LENGTH                    0x00000001

#define _SSP1CON1_SSPM0_POSITION                 0x00000000
#define _SSP1CON1_SSPM0_MASK                     0x00000001
#define _SSP1CON1_SSPM0_LENGTH                   0x00000001

#define _SSP1CON1_SSPM1_POSITION                 0x00000001
#define _SSP1CON1_SSPM1_MASK                     0x00000002
#define _SSP1CON1_SSPM1_LENGTH                   0x00000001

#define _SSP1CON1_SSPM2_POSITION                 0x00000002
#define _SSP1CON1_SSPM2_MASK                     0x00000004
#define _SSP1CON1_SSPM2_LENGTH                   0x00000001

#define _SSP1CON1_SSPM3_POSITION                 0x00000003
#define _SSP1CON1_SSPM3_MASK                     0x00000008
#define _SSP1CON1_SSPM3_LENGTH                   0x00000001

#define _SSP1CON2_SEN_POSITION                   0x00000000
#define _SSP1CON2_SEN_MASK                       0x00000001
#define _SSP1CON2_SEN_LENGTH                     0x00000001

#define _SSP1CON2_RSEN_POSITION                  0x00000001
#define _SSP1CON2_RSEN_MASK                      0x00000002
#define _SSP1CON2_RSEN_LENGTH                    0x00000001

#define _SSP1CON2_PEN_POSITION                   0x00000002
#define _SSP1CON2_PEN_MASK                       0x00000004
#define _SSP1CON2_PEN_LENGTH                     0x00000001

#define _SSP1CON2_RCEN_POSITION                  0x00000003
#define _SSP1CON2_RCEN_MASK                      0x00000008
#define _SSP1CON2_RCEN_LENGTH                    0x00000001

