Ryan-Rogers/MMSoftware/MM_2015.X/support/pic24f/h/p24F08KL402.h
#define _SSP1STAT_I2C_READ_POSITION              0x00000002
#define _SSP1STAT_I2C_READ_MASK                  0x00000004
#define _SSP1STAT_I2C_READ_LENGTH                0x00000001

#define _SSP1STAT_I2C_START_POSITION             0x00000003
#define _SSP1STAT_I2C_START_MASK                 0x00000008
#define _SSP1STAT_I2C_START_LENGTH               0x00000001

#define _SSP1STAT_I2C_STOP_POSITION              0x00000004
#define _SSP1STAT_I2C_STOP_MASK                  0x00000010
#define _SSP1STAT_I2C_STOP_LENGTH                0x00000001

#define _SSP1STAT_I2C_DAT_POSITION               0x00000005
#define _SSP1STAT_I2C_DAT_MASK                   0x00000020
#define _SSP1STAT_I2C_DAT_LENGTH                 0x00000001

#define _I2C1ADD_SSPADD_POSITION                 0x00000000
#define _I2C1ADD_SSPADD_MASK                     0x000000FF
#define _I2C1ADD_SSPADD_LENGTH                   0x00000008

#define _I2C1ADD_I2CADD_POSITION                 0x00000000
#define _I2C1ADD_I2CADD_MASK                     0x000000FF
#define _I2C1ADD_I2CADD_LENGTH                   0x00000008

#define _SSP1ADD_SSPADD_POSITION                 0x00000000
#define _SSP1ADD_SSPADD_MASK                     0x000000FF
#define _SSP1ADD_SSPADD_LENGTH                   0x00000008

#define _SSP1ADD_I2CADD_POSITION                 0x00000000
#define _SSP1ADD_I2CADD_MASK                     0x000000FF
#define _SSP1ADD_I2CADD_LENGTH                   0x00000008

#define _I2C1MSK_MSK0_POSITION                   0x00000000
#define _I2C1MSK_MSK0_MASK                       0x00000001
#define _I2C1MSK_MSK0_LENGTH                     0x00000001

#define _I2C1MSK_MSK1_POSITION                   0x00000001
#define _I2C1MSK_MSK1_MASK                       0x00000002
#define _I2C1MSK_MSK1_LENGTH                     0x00000001

#define _I2C1MSK_MSK2_POSITION                   0x00000002
#define _I2C1MSK_MSK2_MASK                       0x00000004
#define _I2C1MSK_MSK2_LENGTH                     0x00000001

#define _I2C1MSK_MSK3_POSITION                   0x00000003
#define _I2C1MSK_MSK3_MASK                       0x00000008
#define _I2C1MSK_MSK3_LENGTH                     0x00000001

#define _I2C1MSK_MSK4_POSITION                   0x00000004
#define _I2C1MSK_MSK4_MASK                       0x00000010
#define _I2C1MSK_MSK4_LENGTH                     0x00000001

#define _I2C1MSK_MSK5_POSITION                   0x00000005
#define _I2C1MSK_MSK5_MASK                       0x00000020
#define _I2C1MSK_MSK5_LENGTH                     0x00000001

#define _I2C1MSK_MSK6_POSITION                   0x00000006
#define _I2C1MSK_MSK6_MASK                       0x00000040
#define _I2C1MSK_MSK6_LENGTH                     0x00000001

#define _I2C1MSK_MSK7_POSITION                   0x00000007
#define _I2C1MSK_MSK7_MASK                       0x00000080
#define _I2C1MSK_MSK7_LENGTH                     0x00000001

#define _I2C1MSK_AMSK_POSITION                   0x00000000
#define _I2C1MSK_AMSK_MASK                       0x000000FF
#define _I2C1MSK_AMSK_LENGTH                     0x00000008

#define _SSP1MSK_MSK0_POSITION                   0x00000000
#define _SSP1MSK_MSK0_MASK                       0x00000001
#define _SSP1MSK_MSK0_LENGTH                     0x00000001

#define _SSP1MSK_MSK1_POSITION                   0x00000001
#define _SSP1MSK_MSK1_MASK                       0x00000002
#define _SSP1MSK_MSK1_LENGTH                     0x00000001

#define _SSP1MSK_MSK2_POSITION                   0x00000002
#define _SSP1MSK_MSK2_MASK                       0x00000004
#define _SSP1MSK_MSK2_LENGTH                     0x00000001

#define _SSP1MSK_MSK3_POSITION                   0x00000003
#define _SSP1MSK_MSK3_MASK                       0x00000008
#define _SSP1MSK_MSK3_LENGTH                     0x00000001

#define _SSP1MSK_MSK4_POSITION                   0x00000004
#define _SSP1MSK_MSK4_MASK                       0x00000010
#define _SSP1MSK_MSK4_LENGTH                     0x00000001

#define _SSP1MSK_MSK5_POSITION                   0x00000005
#define _SSP1MSK_MSK5_MASK                       0x00000020
#define _SSP1MSK_MSK5_LENGTH                     0x00000001

#define _SSP1MSK_MSK6_POSITION                   0x00000006
#define _SSP1MSK_MSK6_MASK                       0x00000040
#define _SSP1MSK_MSK6_LENGTH                     0x00000001

#define _SSP1MSK_MSK7_POSITION                   0x00000007
#define _SSP1MSK_MSK7_MASK                       0x00000080
#define _SSP1MSK_MSK7_LENGTH                     0x00000001

#define _SSP1MSK_AMSK_POSITION                   0x00000000
#define _SSP1MSK_AMSK_MASK                       0x000000FF
#define _SSP1MSK_AMSK_LENGTH                     0x00000008

#define _SPI2BUF_SSPBUF_POSITION                 0x00000000
#define _SPI2BUF_SSPBUF_MASK                     0x000000FF
#define _SPI2BUF_SSPBUF_LENGTH                   0x00000008

#define _SPI2BUF_SPI2BUF_POSITION                0x00000000
#define _SPI2BUF_SPI2BUF_MASK                    0x000000FF
#define _SPI2BUF_SPI2BUF_LENGTH                  0x00000008

#define _SSP2BUF_SSPBUF_POSITION                 0x00000000
#define _SSP2BUF_SSPBUF_MASK                     0x000000FF
#define _SSP2BUF_SSPBUF_LENGTH                   0x00000008

#define _SSP2BUF_SPI2BUF_POSITION                0x00000000
#define _SSP2BUF_SPI2BUF_MASK                    0x000000FF
#define _SSP2BUF_SPI2BUF_LENGTH                  0x00000008

#define _SSP2CON1_SSPM_POSITION                  0x00000000
#define _SSP2CON1_SSPM_MASK                      0x0000000F
#define _SSP2CON1_SSPM_LENGTH                    0x00000004

#define _SSP2CON1_CKP_POSITION                   0x00000004
#define _SSP2CON1_CKP_MASK                       0x00000010
#define _SSP2CON1_CKP_LENGTH                     0x00000001

#define _SSP2CON1_SSPEN_POSITION                 0x00000005
#define _SSP2CON1_SSPEN_MASK                     0x00000020
#define _SSP2CON1_SSPEN_LENGTH                   0x00000001

#define _SSP2CON1_SSPOV_POSITION                 0x00000006
#define _SSP2CON1_SSPOV_MASK                     0x00000040
#define _SSP2CON1_SSPOV_LENGTH                   0x00000001

#define _SSP2CON1_WCOL_POSITION                  0x00000007
#define _SSP2CON1_WCOL_MASK                      0x00000080
#define _SSP2CON1_WCOL_LENGTH                    0x00000001

#define _SSP2CON1_SSPM0_POSITION                 0x00000000
#define _SSP2CON1_SSPM0_MASK                     0x00000001
#define _SSP2CON1_SSPM0_LENGTH                   0x00000001

#define _SSP2CON1_SSPM1_POSITION                 0x00000001
#define _SSP2CON1_SSPM1_MASK                     0x00000002
#define _SSP2CON1_SSPM1_LENGTH                   0x00000001

#define _SSP2CON1_SSPM2_POSITION                 0x00000002
#define _SSP2CON1_SSPM2_MASK                     0x00000004
#define _SSP2CON1_SSPM2_LENGTH                   0x00000001

